---
kind: type
id: T:Autodesk.Revit.DB.ParameterDownloadOptions
source: html/7359f11b-4102-15f3-597b-51078e1141bc.htm
---
# Autodesk.Revit.DB.ParameterDownloadOptions

An option class used for downloading parameters from the Parameters Service.

## Syntax (C#)
```csharp
public class ParameterDownloadOptions : IDisposable
```